Учет_документов_20.ДокументыИТорги/src/Documents/ТОРГИ/ТОРГИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТОРГИ</name>
  <registerRecords>InformationRegister.ТоргиВРаботе</registerRecords>
  <registerRecords>InformationRegister.ДанныеОСтоимостиЧасаНаТоргах</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыПоТоргам</registerRecords>
  <attributes>
    <name>СостояниеЗакупки</name>
    <type>
      <types>EnumRef.СостоянияЗакупки</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионОказанияУслуг</name>
    <type>
      <types>CatalogRef.РегионыОказанияУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НашКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗакупки</name>
    <type>
      <types>CatalogRef.СпособыЗакупки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПодачиЗаявок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БыстрыеТорги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТоргов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляТоргов</name>
    <type>
      <types>CatalogRef.ВидыПлощадокДляТоргов</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОказанияКонсультаций</name>
    <type>
      <types>EnumRef.УсловияОказанияКонсультаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Безлимит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаНачальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаИтоговая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоНазначилМинимальнуюЦену</name>
    <type>
      <types>CatalogRef.НашиСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНачальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоКакойЦеныМожноСнижать</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоИтогамТоргов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаСБИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПлощадку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПроигрышаТоргов</name>
    <type>
      <types>EnumRef.ПричиныПроигрышаТоргов</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоВыигралТорги</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоСбилЦену</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </attributes>
</mdclass:Document>

Учет_документов_20.ДокументыИТорги/src/AccumulationRegisters/ОборотыПоТоргам/ОборотыПоТоргам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыПоТоргам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПоИтогамТоргов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КтоВыигралТорги</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_документов_20.ДокументыИТорги/src/InformationRegisters/ТоргиВРаботе/ТоргиВРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоргиВРаботе</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаНачальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РегионОказанияУслуг</name>
    <type>
      <types>CatalogRef.РегионыОказанияУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеПодачиЗаявок</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаТоргов</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеЗакупки</name>
    <type>
      <types>EnumRef.СостоянияЗакупки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20.ДокументыИТорги/src/InformationRegisters/ДанныеОСтоимостиЧасаНаТоргах/ДанныеОСтоимостиЧасаНаТоргах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеОСтоимостиЧасаНаТоргах</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЧасаИтоговая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КтоВыигралТорги</name>
    <type>
      <types>CatalogRef.Конкуренты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20.ДокументыИТорги/src/Documents/ТОРГИ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОборотыПоТоргам
	Движения.ОборотыПоТоргам.Записывать = Истина;
	Движение = Движения.ОборотыПоТоргам.Добавить();
	Движение.Период = Дата;
	Движение.КтоВыигралТорги = КтоВыигралТорги;
	Движение.СуммаПоИтогамТоргов = СуммаПоИтогамТоргов;

	// регистр ТоргиВРаботе
	Движения.ТоргиВРаботе.Записывать = Истина;
	Движение = Движения.ТоргиВРаботе.Добавить();
	Движение.РегионОказанияУслуг = РегионОказанияУслуг;
	Движение.Заказчик = Заказчик;
	Движение.ПредметЗакупки = ПредметЗакупки;
	Движение.ОкончаниеПодачиЗаявок = ОкончаниеПодачиЗаявок;
	Движение.ДатаТоргов = ДатаТоргов;
	Движение.СостояниеЗакупки = СостояниеЗакупки;
	Движение.СуммаНачальная = СуммаНачальная;

	// регистр ДанныеОСтоимостиЧасаНаТоргах
	Движения.ДанныеОСтоимостиЧасаНаТоргах.Записывать = Истина;
	Движение = Движения.ДанныеОСтоимостиЧасаНаТоргах.Добавить();
	Движение.Дата = Дата;
	Движение.Период = Дата;
	Движение.КтоВыигралТорги = КтоВыигралТорги;
	Движение.КоличествоЧасов = КоличествоЧасов;
	Движение.СтоимостьЧасаИтоговая = СтоимостьЧасаИтоговая;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
